This Notebook covers the basics of SQL. This does the same things as the Instabase Notebook, but connects to your local instance of PostgreSQL instead. So you can edit and run queries against the database. You should also make sure that you are comfortable using SQL through `psql` (see the [Setup Instructions](https://github.com/umddb/cmsc424-fall2016/tree/master/project0) to get started with that).

The server should already be running (and the `university` database created and populated). The following commands load the requiste modules. 

**NOTE: Although there is a warning, it doesn't seem to affect things.**

In [1]:
%load_ext sql
%sql postgresql://root:root@localhost/university

We can now run SQL commands using `magic` commands, which is an extensibility mechanism provided by Jupyter. %sql is for single-line commands, whereas %%sql allows us to do multi-line SQL commands.

In [2]:
%sql select * from takes;

 * postgresql://root:***@localhost/university
22 rows affected.

[('00128', 'CS-101', '1', 'Fall', Decimal('2009'), 'A'),
 ('00128', 'CS-347', '1', 'Fall', Decimal('2009'), 'A-'),
 ('12345', 'CS-101', '1', 'Fall', Decimal('2009'), 'C'),
 ('12345', 'CS-190', '2', 'Spring', Decimal('2009'), 'A'),
 ('12345', 'CS-315', '1', 'Spring', Decimal('2010'), 'A'),
 ('12345', 'CS-347', '1', 'Fall', Decimal('2009'), 'A'),
 ('19991', 'HIS-351', '1', 'Spring', Decimal('2010'), 'B'),
 ('23121', 'FIN-201', '1', 'Spring', Decimal('2010'), 'C+'),
 ('44553', 'PHY-101', '1', 'Fall', Decimal('2009'), 'B-'),
 ('45678', 'CS-101', '1', 'Fall', Decimal('2009'), 'F'),
 ('45678', 'CS-101', '1', 'Spring', Decimal('2010'), 'B+'),
 ('45678', 'CS-319', '1', 'Spring', Decimal('2010'), 'B'),
 ('54321', 'CS-101', '1', 'Fall', Decimal('2009'), 'A-'),
 ('54321', 'CS-190', '2', 'Spring', Decimal('2009'), 'B+'),
 ('55739', 'MU-199', '1', 'Spring', Decimal('2010'), 'A-'),
 ('76543', 'CS-101', '1', 'Fall', Decimal('2009'), 'A'),
 ('76543', 'CS-319', '2', 'Spring', Decimal('2010'), 'A'),
 ('76653', 'EE-181', '1', 'Spring', Decimal('2009'), 'C'),
 ('98765', 'CS-101', '1', 'Fall', Decimal('2009'), 'C-'),
 ('98765', 'CS-315', '1', 'Spring', Decimal('2010'), 'B'),
 ('98988', 'BIO-101', '1', 'Summer', Decimal('2009'), 'A'),
 ('98988', 'BIO-301', '1', 'Summer', Decimal('2010'), None)]

One drawback of this way of accessing the database is that we can only run valid SQL -- the commands like `\d` provided by `psql` are not available to us. Instead, we will need to query the system catalog (metadata) directly. The first command below is equivalent to `\d`, whereas the second one is similar to `\d instructor`.

In [3]:
%%sql
SELECT table_schema, table_name FROM information_schema.tables
    WHERE table_type = 'BASE TABLE' AND
    table_schema NOT IN ('pg_catalog', 'information_schema', 'priv');

 * postgresql://root:***@localhost/university
14 rows affected.

[('public', 'department'),
 ('public', 'course'),
 ('public', 'instructor'),
 ('public', 'section'),
 ('public', 'classroom'),
 ('public', 'teaches'),
 ('public', 'student'),
 ('public', 'takes'),
 ('public', 'advisor'),
 ('public', 'time_slot'),
 ('public', 'prereq'),
 ('public', 'advisor_copy'),
 ('public', 'advisees'),
 ('public', 'sal_emp')]

In [4]:
%%sql
SELECT column_name, data_type
    FROM INFORMATION_SCHEMA.COLUMNS WHERE table_name = 'instructor';

 * postgresql://root:***@localhost/university
4 rows affected.

[('id', 'character varying'),
 ('name', 'character varying'),
 ('dept_name', 'character varying'),
 ('salary', 'numeric')]

### University Database
Below we will use the University database from the class textbook. The University Dataset is the same as the one discussed in the book, and contains randomly populated information about the students, courses, and instructors in a university. 

You should follow the rest of the Notebook along with the appropriate sections in the book.

The schema diagram for the database is as follows:
<center><img src="https://github.com/umddb/cmsc424-fall2015/raw/master/postgresql-setup/university.png" width=800px></center>

### SQL Data Definition Language (Section 3.2)

You can take a look at the `DDL.sql` file to see how the tables we are using are created. We won't try to run those commands here since they will only give errors. 
Here is how the department table is created. The `primary key` is specified using the special clause.
```
create table department
        (dept_name              varchar(20),
         building               varchar(15),
         budget                 numeric(12,2) check (budget > 0),
         primary key (dept_name)
        );
```

The instructor table is created simiarly and it references the primary key of the department (and hence called `foreign key`).
```
create table instructor
        (ID                     varchar(5),
         name                   varchar(20) not null,
         dept_name              varchar(20),
         salary                 numeric(8,2) check (salary > 29000),
         primary key (ID),
         foreign key (dept_name) references department
                on delete set null
        );
```
Command for inserting a new instructor is also straightforward.
```
insert into instructor values ('10101', 'Srinivasan', 'Comp. Sci.', '65000');
```
If the 'Comp. Sci.' department is not present in the `department` table already, we have a `referential integrity violation`, and the insert command would be rejected.

### Select Queries on a Single Relation (Section 3.3.1)
Let's start with the most basic queries. The following query reports the courses with titles containing Biology.

In [5]:
%sql select * from course where title like '%Biology%';

 * postgresql://root:***@localhost/university
2 rows affected.

[('BIO-101', 'Intro. to Biology', 'Biology', Decimal('4')),
 ('BIO-399', 'Computational Biology', 'Biology', Decimal('3'))]

There are two  courses. How many students are enrolled in the first one (ever)? What about in Summer 2009?

In [6]:
%sql select * from takes where course_id = 'BIO-101';

 * postgresql://root:***@localhost/university
1 rows affected.

[('98988', 'BIO-101', '1', 'Summer', Decimal('2009'), 'A')]

In [7]:
%sql select * from takes where course_id = 'BIO-101'  and year = 2009 and semester = 'Summer';

 * postgresql://root:***@localhost/university
1 rows affected.

[('98988', 'BIO-101', '1', 'Summer', Decimal('2009'), 'A')]

### Aggregates

Count the number of instructors in Finance

In [8]:
%sql select count(*) from instructor where dept_name = 'Finance';

 * postgresql://root:***@localhost/university
1 rows affected.

[(2,)]

Find the instructor(s) with the highest salary. Note that using a nested "subquery" (which first finds the maximum value of the salary) as below is the most compact way to write this query.

In [9]:
%%sql 
select *
from instructor
where salary = (select max(salary) from instructor);

 * postgresql://root:***@localhost/university
1 rows affected.

[('22222', 'Einstein', 'Physics', Decimal('95000.00'))]

### Joins and Cartesian Product (Section 3.3.2)
To find building names for all instructors, we must do a join between two relations.

In [10]:
%%sql
select name, instructor.dept_name, building
from instructor, department
where instructor.dept_name = department.dept_name;

 * postgresql://root:***@localhost/university
12 rows affected.

[('Srinivasan', 'Comp. Sci.', 'Taylor'),
 ('Wu', 'Finance', 'Painter'),
 ('Mozart', 'Music', 'Packard'),
 ('Einstein', 'Physics', 'Watson'),
 ('El Said', 'History', 'Painter'),
 ('Gold', 'Physics', 'Watson'),
 ('Katz', 'Comp. Sci.', 'Taylor'),
 ('Califieri', 'History', 'Painter'),
 ('Singh', 'Finance', 'Painter'),
 ('Crick', 'Biology', 'Watson'),
 ('Brandt', 'Comp. Sci.', 'Taylor'),
 ('Kim', 'Elec. Eng.', 'Taylor')]

Since the join here is a equality join on the common attributes in the two relations, we can also just do:

In [11]:
%%sql 
select name, instructor.dept_name, building
from instructor natural join department;

 * postgresql://root:***@localhost/university
12 rows affected.

[('Srinivasan', 'Comp. Sci.', 'Taylor'),
 ('Wu', 'Finance', 'Painter'),
 ('Mozart', 'Music', 'Packard'),
 ('Einstein', 'Physics', 'Watson'),
 ('El Said', 'History', 'Painter'),
 ('Gold', 'Physics', 'Watson'),
 ('Katz', 'Comp. Sci.', 'Taylor'),
 ('Califieri', 'History', 'Painter'),
 ('Singh', 'Finance', 'Painter'),
 ('Crick', 'Biology', 'Watson'),
 ('Brandt', 'Comp. Sci.', 'Taylor'),
 ('Kim', 'Elec. Eng.', 'Taylor')]

On the other hand, just doing the following (i.e., just the Cartesian Product) will lead to a large number of tuples, most of which are not meaningful.

In [12]:
%%sql
select name, instructor.dept_name, building
from instructor, department;

 * postgresql://root:***@localhost/university
84 rows affected.

[('Srinivasan', 'Comp. Sci.', 'Watson'),
 ('Wu', 'Finance', 'Watson'),
 ('Mozart', 'Music', 'Watson'),
 ('Einstein', 'Physics', 'Watson'),
 ('El Said', 'History', 'Watson'),
 ('Gold', 'Physics', 'Watson'),
 ('Katz', 'Comp. Sci.', 'Watson'),
 ('Califieri', 'History', 'Watson'),
 ('Singh', 'Finance', 'Watson'),
 ('Crick', 'Biology', 'Watson'),
 ('Brandt', 'Comp. Sci.', 'Watson'),
 ('Kim', 'Elec. Eng.', 'Watson'),
 ('Srinivasan', 'Comp. Sci.', 'Taylor'),
 ('Wu', 'Finance', 'Taylor'),
 ('Mozart', 'Music', 'Taylor'),
 ('Einstein', 'Physics', 'Taylor'),
 ('El Said', 'History', 'Taylor'),
 ('Gold', 'Physics', 'Taylor'),
 ('Katz', 'Comp. Sci.', 'Taylor'),
 ('Califieri', 'History', 'Taylor'),
 ('Singh', 'Finance', 'Taylor'),
 ('Crick', 'Biology', 'Taylor'),
 ('Brandt', 'Comp. Sci.', 'Taylor'),
 ('Kim', 'Elec. Eng.', 'Taylor'),
 ('Srinivasan', 'Comp. Sci.', 'Taylor'),
 ('Wu', 'Finance', 'Taylor'),
 ('Mozart', 'Music', 'Taylor'),
 ('Einstein', 'Physics', 'Taylor'),
 ('El Said', 'History', 'Taylor'),
 ('Gold', 'Physics', 'Taylor'),
 ('Katz', 'Comp. Sci.', 'Taylor'),
 ('Califieri', 'History', 'Taylor'),
 ('Singh', 'Finance', 'Taylor'),
 ('Crick', 'Biology', 'Taylor'),
 ('Brandt', 'Comp. Sci.', 'Taylor'),
 ('Kim', 'Elec. Eng.', 'Taylor'),
 ('Srinivasan', 'Comp. Sci.', 'Painter'),
 ('Wu', 'Finance', 'Painter'),
 ('Mozart', 'Music', 'Painter'),
 ('Einstein', 'Physics', 'Painter'),
 ('El Said', 'History', 'Painter'),
 ('Gold', 'Physics', 'Painter'),
 ('Katz', 'Comp. Sci.', 'Painter'),
 ('Califieri', 'History', 'Painter'),
 ('Singh', 'Finance', 'Painter'),
 ('Crick', 'Biology', 'Painter'),
 ('Brandt', 'Comp. Sci.', 'Painter'),
 ('Kim', 'Elec. Eng.', 'Painter'),
 ('Srinivasan', 'Comp. Sci.', 'Painter'),
 ('Wu', 'Finance', 'Painter'),
 ('Mozart', 'Music', 'Painter'),
 ('Einstein', 'Physics', 'Painter'),
 ('El Said', 'History', 'Painter'),
 ('Gold', 'Physics', 'Painter'),
 ('Katz', 'Comp. Sci.', 'Painter'),
 ('Califieri', 'History', 'Painter'),
 ('Singh', 'Finance', 'Painter'),
 ('Crick', 'Biology', 'Painter'),
 ('Brandt', 'Comp. Sci.', 'Painter'),
 ('Kim', 'Elec. Eng.', 'Painter'),
 ('Srinivasan', 'Comp. Sci.', 'Packard'),
 ('Wu', 'Finance', 'Packard'),
 ('Mozart', 'Music', 'Packard'),
 ('Einstein', 'Physics', 'Packard'),
 ('El Said', 'History', 'Packard'),
 ('Gold', 'Physics', 'Packard'),
 ('Katz', 'Comp. Sci.', 'Packard'),
 ('Califieri', 'History', 'Packard'),
 ('Singh', 'Finance', 'Packard'),
 ('Crick', 'Biology', 'Packard'),
 ('Brandt', 'Comp. Sci.', 'Packard'),
 ('Kim', 'Elec. Eng.', 'Packard'),
 ('Srinivasan', 'Comp. Sci.', 'Watson'),
 ('Wu', 'Finance', 'Watson'),
 ('Mozart', 'Music', 'Watson'),
 ('Einstein', 'Physics', 'Watson'),
 ('El Said', 'History', 'Watson'),
 ('Gold', 'Physics', 'Watson'),
 ('Katz', 'Comp. Sci.', 'Watson'),
 ('Califieri', 'History', 'Watson'),
 ('Singh', 'Finance', 'Watson'),
 ('Crick', 'Biology', 'Watson'),
 ('Brandt', 'Comp. Sci.', 'Watson'),
 ('Kim', 'Elec. Eng.', 'Watson')]

### Renaming using "as"
**as** can be used to rename tables and simplify queries:

In [13]:
%%sql
explain select distinct T.name
from instructor as T, instructor as S  
where T.salary > S.salary and S.dept_name = 'Biology';

 * postgresql://root:***@localhost/university
8 rows affected.

[('HashAggregate  (cost=43.84..45.84 rows=200 width=58)',),
 ('  Group Key: t.name',),
 ('  ->  Nested Loop  (cost=0.00..43.10 rows=293 width=58)',),
 ('        Join Filter: (t.salary > s.salary)',),
 ('        ->  Seq Scan on instructor t  (cost=0.00..14.40 rows=440 width=72)',),
 ('        ->  Materialize  (cost=0.00..15.51 rows=2 width=14)',),
 ('              ->  Seq Scan on instructor s  (cost=0.00..15.50 rows=2 width=14)',),
 ("                    Filter: ((dept_name)::text = 'Biology'::text)",)]

**Self-joins** (where two of the relations in the from clause are the same) are impossible without using `as`. The following query associates a course with the pre-requisite of one of its pre-requisites. There is no way to disambiguate the columns without some form of renaming.

In [14]:
%%sql
explain analyze select p1.course_id, p2.prereq_id as pre_prereq_id
from prereq p1, prereq p2
where p1.prereq_id = p2.course_id;

 * postgresql://root:***@localhost/university
8 rows affected.

[('Hash Join  (cost=29.12..176.18 rows=3612 width=68) (actual time=0.171..0.173 rows=0 loops=1)',),
 ('  Hash Cond: ((p1.prereq_id)::text = (p2.course_id)::text)',),
 ('  ->  Seq Scan on prereq p1  (cost=0.00..18.50 rows=850 width=68) (actual time=0.077..0.078 rows=7 loops=1)',),
 ('  ->  Hash  (cost=18.50..18.50 rows=850 width=68) (actual time=0.020..0.020 rows=7 loops=1)',),
 ('        Buckets: 1024  Batches: 1  Memory Usage: 9kB',),
 ('        ->  Seq Scan on prereq p2  (cost=0.00..18.50 rows=850 width=68) (actual time=0.013..0.014 rows=7 loops=1)',),
 ('Planning Time: 0.198 ms',),
 ('Execution Time: 0.957 ms',)]

The small University database doesn't have any chains of this kind. You can try adding a new tuple using a new tuple. Now the query will return an answer.

In [15]:
%sql insert into prereq values ('CS-101', 'PHY-101');

 * postgresql://root:***@localhost/university
1 rows affected.

[]

In [16]:
%%sql
select p1.course_id, p2.prereq_id as pre_prereq_id
from prereq p1, prereq p2
where p1.prereq_id = p2.course_id;

 * postgresql://root:***@localhost/university
4 rows affected.

[('CS-190', 'PHY-101'),
 ('CS-315', 'PHY-101'),
 ('CS-319', 'PHY-101'),
 ('CS-347', 'PHY-101')]

### Set Operations
*Union* operation can be used to combine information from two tables (from Section 3.5.1).

In [17]:
%%sql
select course_id
from section
where semester = 'Fall' and year= 2009
union 
select course_id
from section
where semester = 'Spring' and year= 2010;

 * postgresql://root:***@localhost/university
8 rows affected.

[('CS-101',),
 ('CS-315',),
 ('CS-319',),
 ('CS-347',),
 ('FIN-201',),
 ('HIS-351',),
 ('MU-199',),
 ('PHY-101',)]

### Aggregation with Grouping (Section 7.4.2)

In [18]:
%%sql
select dept_name, avg(salary) as avg_salary
from instructor
group by dept_name;

 * postgresql://root:***@localhost/university
7 rows affected.

[('Finance', Decimal('85000.000000000000')),
 ('History', Decimal('61000.000000000000')),
 ('Physics', Decimal('91000.000000000000')),
 ('Music', Decimal('40000.000000000000')),
 ('Comp. Sci.', Decimal('77333.333333333333')),
 ('Biology', Decimal('72000.000000000000')),
 ('Elec. Eng.', Decimal('80000.000000000000'))]

You can use `having` to filter out groups. The following query only returns the average salary for departments with more than 2 instructors.

In [19]:
%%sql
select dept_name, avg(salary) as avg_salary
from instructor
group by dept_name
having count(*) > 2;

 * postgresql://root:***@localhost/university
1 rows affected.

[('Comp. Sci.', Decimal('77333.333333333333'))]

### WITH
In many cases you might find it easier to create temporary tables, especially for queries involving finding "max" or "min". This also allows you to break down the full query and makes it easier to debug. It is preferable to use the WITH construct for this purpose. The syntax and support differs across systems, but here is the link to PostgreSQL: http://www.postgresql.org/docs/9.0/static/queries-with.html

These are also called Common Table Expressions (CTEs).

The following query is from Section 3.8.6.

In [20]:
%%sql
with max_budget(value) as (
select max(budget)
from department
)
select budget
from department, max_budget
where department.budget = max_budget.value;

 * postgresql://root:***@localhost/university
1 rows affected.

[(Decimal('120000.00'),)]

### LIMIT
PostgreSQL allows you to limit the number of results displayed which
is useful for debugging etc. Here is an example.

In [21]:
%sql select * from instructor limit 2;

 * postgresql://root:***@localhost/university
2 rows affected.

[('10101', 'Srinivasan', 'Comp. Sci.', Decimal('65000.00')),
 ('12121', 'Wu', 'Finance', Decimal('90000.00'))]

### Try your own queries
Feel free to use the cells below to write new queries. You can also just modify the above queries directly if you'd like.

In [25]:
%sql select * \
from course c, instructor i, teaches t, takes tt \
where c.course_id = t.course_id and i.id = t.id and tt.course_id = c.course_id \
order by i.id, c.course_id;

 * postgresql://root:***@localhost/university
33 rows affected.

[('CS-101', 'Intro. to Computer Science', 'Comp. Sci.', Decimal('4'), '10101', 'Srinivasan', 'Comp. Sci.', Decimal('65000.00'), '10101', 'CS-101', '1', 'Fall', Decimal('2009'), '98765', 'CS-101', '1', 'Fall', Decimal('2009'), 'C-'),
 ('CS-101', 'Intro. to Computer Science', 'Comp. Sci.', Decimal('4'), '10101', 'Srinivasan', 'Comp. Sci.', Decimal('65000.00'), '10101', 'CS-101', '1', 'Fall', Decimal('2009'), '76543', 'CS-101', '1', 'Fall', Decimal('2009'), 'A'),
 ('CS-101', 'Intro. to Computer Science', 'Comp. Sci.', Decimal('4'), '10101', 'Srinivasan', 'Comp. Sci.', Decimal('65000.00'), '10101', 'CS-101', '1', 'Fall', Decimal('2009'), '54321', 'CS-101', '1', 'Fall', Decimal('2009'), 'A-'),
 ('CS-101', 'Intro. to Computer Science', 'Comp. Sci.', Decimal('4'), '10101', 'Srinivasan', 'Comp. Sci.', Decimal('65000.00'), '10101', 'CS-101', '1', 'Fall', Decimal('2009'), '45678', 'CS-101', '1', 'Spring', Decimal('2010'), 'B+'),
 ('CS-101', 'Intro. to Computer Science', 'Comp. Sci.', Decimal('4'), '10101', 'Srinivasan', 'Comp. Sci.', Decimal('65000.00'), '10101', 'CS-101', '1', 'Fall', Decimal('2009'), '45678', 'CS-101', '1', 'Fall', Decimal('2009'), 'F'),
 ('CS-101', 'Intro. to Computer Science', 'Comp. Sci.', Decimal('4'), '10101', 'Srinivasan', 'Comp. Sci.', Decimal('65000.00'), '10101', 'CS-101', '1', 'Fall', Decimal('2009'), '12345', 'CS-101', '1', 'Fall', Decimal('2009'), 'C'),
 ('CS-101', 'Intro. to Computer Science', 'Comp. Sci.', Decimal('4'), '10101', 'Srinivasan', 'Comp. Sci.', Decimal('65000.00'), '10101', 'CS-101', '1', 'Fall', Decimal('2009'), '00128', 'CS-101', '1', 'Fall', Decimal('2009'), 'A'),
 ('CS-315', 'Robotics', 'Comp. Sci.', Decimal('3'), '10101', 'Srinivasan', 'Comp. Sci.', Decimal('65000.00'), '10101', 'CS-315', '1', 'Spring', Decimal('2010'), '98765', 'CS-315', '1', 'Spring', Decimal('2010'), 'B'),
 ('CS-315', 'Robotics', 'Comp. Sci.', Decimal('3'), '10101', 'Srinivasan', 'Comp. Sci.', Decimal('65000.00'), '10101', 'CS-315', '1', 'Spring', Decimal('2010'), '12345', 'CS-315', '1', 'Spring', Decimal('2010'), 'A'),
 ('CS-347', 'Database System Concepts', 'Comp. Sci.', Decimal('3'), '10101', 'Srinivasan', 'Comp. Sci.', Decimal('65000.00'), '10101', 'CS-347', '1', 'Fall', Decimal('2009'), '12345', 'CS-347', '1', 'Fall', Decimal('2009'), 'A'),
 ('CS-347', 'Database System Concepts', 'Comp. Sci.', Decimal('3'), '10101', 'Srinivasan', 'Comp. Sci.', Decimal('65000.00'), '10101', 'CS-347', '1', 'Fall', Decimal('2009'), '00128', 'CS-347', '1', 'Fall', Decimal('2009'), 'A-'),
 ('FIN-201', 'Investment Banking', 'Finance', Decimal('3'), '12121', 'Wu', 'Finance', Decimal('90000.00'), '12121', 'FIN-201', '1', 'Spring', Decimal('2010'), '23121', 'FIN-201', '1', 'Spring', Decimal('2010'), 'C+'),
 ('MU-199', 'Music Video Production', 'Music', Decimal('3'), '15151', 'Mozart', 'Music', Decimal('40000.00'), '15151', 'MU-199', '1', 'Spring', Decimal('2010'), '55739', 'MU-199', '1', 'Spring', Decimal('2010'), 'A-'),
 ('PHY-101', 'Physical Principles', 'Physics', Decimal('4'), '22222', 'Einstein', 'Physics', Decimal('95000.00'), '22222', 'PHY-101', '1', 'Fall', Decimal('2009'), '44553', 'PHY-101', '1', 'Fall', Decimal('2009'), 'B-'),
 ('HIS-351', 'World History', 'History', Decimal('3'), '32343', 'El Said', 'History', Decimal('60000.00'), '32343', 'HIS-351', '1', 'Spring', Decimal('2010'), '19991', 'HIS-351', '1', 'Spring', Decimal('2010'), 'B'),
 ('CS-101', 'Intro. to Computer Science', 'Comp. Sci.', Decimal('4'), '45565', 'Katz', 'Comp. Sci.', Decimal('75000.00'), '45565', 'CS-101', '1', 'Spring', Decimal('2010'), '98765', 'CS-101', '1', 'Fall', Decimal('2009'), 'C-'),
 ('CS-101', 'Intro. to Computer Science', 'Comp. Sci.', Decimal('4'), '45565', 'Katz', 'Comp. Sci.', Decimal('75000.00'), '45565', 'CS-101', '1', 'Spring', Decimal('2010'), '76543', 'CS-101', '1', 'Fall', Decimal('2009'), 'A'),
 ('CS-101', 'Intro. to Computer Science', 'Comp. Sci.', Decimal('4'), '45565', 'Katz', 'Comp. Sci.', Decimal('75000.00'), '45565', 'CS-101', '1', 'Spring', Decimal('2010'), '54321', 'CS-101', '1', 'Fall', Decimal('2009'), 'A-'),
 ('CS-101', 'Intro. to Computer Science', 'Comp. Sci.', Decimal('4'), '45565', 'Katz', 'Comp. Sci.', Decimal('75000.00'), '45565', 'CS-101', '1', 'Spring', Decimal('2010'), '45678', 'CS-101', '1', 'Spring', Decimal('2010'), 'B+'),
 ('CS-101', 'Intro. to Computer Science', 'Comp. Sci.', Decimal('4'), '45565', 'Katz', 'Comp. Sci.', Decimal('75000.00'), '45565', 'CS-101', '1', 'Spring', Decimal('2010'), '45678', 'CS-101', '1', 'Fall', Decimal('2009'), 'F'),
 ('CS-101', 'Intro. to Computer Science', 'Comp. Sci.', Decimal('4'), '45565', 'Katz', 'Comp. Sci.', Decimal('75000.00'), '45565', 'CS-101', '1', 'Spring', Decimal('2010'), '12345', 'CS-101', '1', 'Fall', Decimal('2009'), 'C'),
 ('CS-101', 'Intro. to Computer Science', 'Comp. Sci.', Decimal('4'), '45565', 'Katz', 'Comp. Sci.', Decimal('75000.00'), '45565', 'CS-101', '1', 'Spring', Decimal('2010'), '00128', 'CS-101', '1', 'Fall', Decimal('2009'), 'A'),
 ('CS-319', 'Image Processing', 'Comp. Sci.', Decimal('3'), '45565', 'Katz', 'Comp. Sci.', Decimal('75000.00'), '45565', 'CS-319', '1', 'Spring', Decimal('2010'), '76543', 'CS-319', '2', 'Spring', Decimal('2010'), 'A'),
 ('CS-319', 'Image Processing', 'Comp. Sci.', Decimal('3'), '45565', 'Katz', 'Comp. Sci.', Decimal('75000.00'), '45565', 'CS-319', '1', 'Spring', Decimal('2010'), '45678', 'CS-319', '1', 'Spring', Decimal('2010'), 'B'),
 ('BIO-101', 'Intro. to Biology', 'Biology', Decimal('4'), '76766', 'Crick', 'Biology', Decimal('72000.00'), '76766', 'BIO-101', '1', 'Summer', Decimal('2009'), '98988', 'BIO-101', '1', 'Summer', Decimal('2009'), 'A'),
 ('BIO-301', 'Genetics', 'Biology', Decimal('4'), '76766', 'Crick', 'Biology', Decimal('72000.00'), '76766', 'BIO-301', '1', 'Summer', Decimal('2010'), '98988', 'BIO-301', '1', 'Summer', Decimal('2010'), None),
 ('CS-190', 'Game Design', 'Comp. Sci.', Decimal('4'), '83821', 'Brandt', 'Comp. Sci.', Decimal('92000.00'), '83821', 'CS-190', '1', 'Spring', Decimal('2009'), '54321', 'CS-190', '2', 'Spring', Decimal('2009'), 'B+'),
 ('CS-190', 'Game Design', 'Comp. Sci.', Decimal('4'), '83821', 'Brandt', 'Comp. Sci.', Decimal('92000.00'), '83821', 'CS-190', '1', 'Spring', Decimal('2009'), '12345', 'CS-190', '2', 'Spring', Decimal('2009'), 'A'),
 ('CS-190', 'Game Design', 'Comp. Sci.', Decimal('4'), '83821', 'Brandt', 'Comp. Sci.', Decimal('92000.00'), '83821', 'CS-190', '2', 'Spring', Decimal('2009'), '54321', 'CS-190', '2', 'Spring', Decimal('2009'), 'B+'),
 ('CS-190', 'Game Design', 'Comp. Sci.', Decimal('4'), '83821', 'Brandt', 'Comp. Sci.', Decimal('92000.00'), '83821', 'CS-190', '2', 'Spring', Decimal('2009'), '12345', 'CS-190', '2', 'Spring', Decimal('2009'), 'A'),
 ('CS-319', 'Image Processing', 'Comp. Sci.', Decimal('3'), '83821', 'Brandt', 'Comp. Sci.', Decimal('92000.00'), '83821', 'CS-319', '2', 'Spring', Decimal('2010'), '76543', 'CS-319', '2', 'Spring', Decimal('2010'), 'A'),
 ('CS-319', 'Image Processing', 'Comp. Sci.', Decimal('3'), '83821', 'Brandt', 'Comp. Sci.', Decimal('92000.00'), '83821', 'CS-319', '2', 'Spring', Decimal('2010'), '45678', 'CS-319', '1', 'Spring', Decimal('2010'), 'B'),
 ('EE-181', 'Intro. to Digital Systems', 'Elec. Eng.', Decimal('3'), '98345', 'Kim', 'Elec. Eng.', Decimal('80000.00'), '98345', 'EE-181', '1', 'Spring', Decimal('2009'), '76653', 'EE-181', '1', 'Spring', Decimal('2009'), 'C')]

In [28]:
%sql select title,       \
          (select count(*) from takes where course_id = c.course_id and grade = 'A') as A, \
          (select count(*) from takes where course_id = c.course_id and grade = 'B') as B, \
          (select count(*) from takes where course_id = c.course_id and grade = 'C') as C, \
          (select count(*) from takes where course_id = c.course_id and grade = 'D') as D, \
          (select count(*) from takes where course_id = c.course_id and grade = 'F') as F \
from course c;

 * postgresql://root:***@localhost/university
13 rows affected.

[('Intro. to Biology', 1, 0, 0, 0, 0),
 ('Genetics', 0, 0, 0, 0, 0),
 ('Computational Biology', 0, 0, 0, 0, 0),
 ('Intro. to Computer Science', 2, 0, 1, 0, 1),
 ('Game Design', 1, 0, 0, 0, 0),
 ('Robotics', 1, 1, 0, 0, 0),
 ('Image Processing', 1, 1, 0, 0, 0),
 ('Database System Concepts', 1, 0, 0, 0, 0),
 ('Intro. to Digital Systems', 0, 0, 1, 0, 0),
 ('Investment Banking', 0, 0, 0, 0, 0),
 ('World History', 0, 1, 0, 0, 0),
 ('Music Video Production', 0, 0, 0, 0, 0),
 ('Physical Principles', 0, 0, 0, 0, 0)]

In [40]:
%sql select t.course_id, tc.id, array_agg(grade) \
from takes t join teaches tc on (t.course_id = tc.course_id and t.sec_id = tc.sec_id \
and t.semester = tc.semester and t.year = tc.year) \
group by t.course_id, tc.id;

 * postgresql://root:***@localhost/university
14 rows affected.

[('BIO-101', '76766', ['A']),
 ('BIO-301', '76766', [None]),
 ('CS-101', '10101', ['A', 'C', 'F', 'A-', 'A', 'C-']),
 ('CS-101', '45565', ['B+']),
 ('CS-190', '83821', ['B+', 'A']),
 ('CS-315', '10101', ['A', 'B']),
 ('CS-319', '45565', ['B']),
 ('CS-319', '83821', ['A']),
 ('CS-347', '10101', ['A', 'A-']),
 ('EE-181', '98345', ['C']),
 ('FIN-201', '12121', ['C+']),
 ('HIS-351', '32343', ['B']),
 ('MU-199', '15151', ['A-']),
 ('PHY-101', '22222', ['B-'])]

In [39]:
%sql select takes.*, case when takes.grade = 'A' then 4 when takes.grade = 'B' then 3 end from takes;

 * postgresql://root:***@localhost/university
22 rows affected.

[('00128', 'CS-101', '1', 'Fall', Decimal('2009'), 'A', 4),
 ('00128', 'CS-347', '1', 'Fall', Decimal('2009'), 'A-', None),
 ('12345', 'CS-101', '1', 'Fall', Decimal('2009'), 'C', None),
 ('12345', 'CS-190', '2', 'Spring', Decimal('2009'), 'A', 4),
 ('12345', 'CS-315', '1', 'Spring', Decimal('2010'), 'A', 4),
 ('12345', 'CS-347', '1', 'Fall', Decimal('2009'), 'A', 4),
 ('19991', 'HIS-351', '1', 'Spring', Decimal('2010'), 'B', 3),
 ('23121', 'FIN-201', '1', 'Spring', Decimal('2010'), 'C+', None),
 ('44553', 'PHY-101', '1', 'Fall', Decimal('2009'), 'B-', None),
 ('45678', 'CS-101', '1', 'Fall', Decimal('2009'), 'F', None),
 ('45678', 'CS-101', '1', 'Spring', Decimal('2010'), 'B+', None),
 ('45678', 'CS-319', '1', 'Spring', Decimal('2010'), 'B', 3),
 ('54321', 'CS-101', '1', 'Fall', Decimal('2009'), 'A-', None),
 ('54321', 'CS-190', '2', 'Spring', Decimal('2009'), 'B+', None),
 ('55739', 'MU-199', '1', 'Spring', Decimal('2010'), 'A-', None),
 ('76543', 'CS-101', '1', 'Fall', Decimal('2009'), 'A', 4),
 ('76543', 'CS-319', '2', 'Spring', Decimal('2010'), 'A', 4),
 ('76653', 'EE-181', '1', 'Spring', Decimal('2009'), 'C', None),
 ('98765', 'CS-101', '1', 'Fall', Decimal('2009'), 'C-', None),
 ('98765', 'CS-315', '1', 'Spring', Decimal('2010'), 'B', 3),
 ('98988', 'BIO-101', '1', 'Summer', Decimal('2009'), 'A', 4),
 ('98988', 'BIO-301', '1', 'Summer', Decimal('2010'), None, None)]

In [46]:
%sql select t1.id, t2.id, count(*) from takes t1, takes t2 where t1.course_id = t2.course_id and t1.id > t2.id\
group by t1.id, t2.id;

 * postgresql://root:***@localhost/university
15 rows affected.

[('45678', '12345', 2),
 ('98765', '54321', 1),
 ('54321', '12345', 2),
 ('76543', '12345', 1),
 ('76543', '00128', 1),
 ('54321', '45678', 2),
 ('98765', '76543', 1),
 ('76543', '54321', 1),
 ('12345', '00128', 2),
 ('98765', '00128', 1),
 ('54321', '00128', 1),
 ('45678', '00128', 2),
 ('98765', '12345', 2),
 ('98765', '45678', 2),
 ('76543', '45678', 3)]